Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM3220G-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                 |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |WAKEUP [Button B2]          |    |    |    |     |     |     |      |      |      |      |*IN0 |*TIM5_CH1 *TIM2_CH1                       |          |    |          |           
PA1 , // |MII_RX_CLK/RMII_REF_CLK     |    |    |    |     |     |     |      |      |      |      |*IN1 |*TIM5_CH2 *TIM2_CH2                       |          |    |          |           
PA2 , // |MII_MDIO                    |    |    |    |     |     |     |      |*TX   |      |      |*IN2 |*TIM5_CH3 +TIM9_CH1 *TIM2_CH3             |          |    |          |           
PA3 , // |ULPI_D0                     |    |    |    |     |     |     |      |*RX   |      |      |*IN3 |*TIM5_CH4 +TIM9_CH2 *TIM2_CH4             |          |    |          |           
PA4 , // |Audio_DAC_OUT [CS43L22_AIN1]|    |    |    |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |ULPI_CLK                    |    |    |    |*SCK |     |     |      |      |      |      |*IN5 |*TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |DCMI_PIXCK                  |    |    |    |*MISO|     |     |      |      |      |      |*IN6 |*TIM3_CH1 +TIM13_CH1                      |          |    |          |           
PA7 , // |MII_RX_DV/RMII_CRSDV        |    |    |    |*MOSI|     |     |      |      |      |      |*IN7 |*TIM1_CH1N +TIM8_CH1N *TIM3_CH2 +TIM14_CH1|          |    |          |           
PA8 , // |MCO                         |    |    |+SCL|     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |    |          |           
PA9 , // |VBUS_FS                     |    |    |    |     |     |     |*TX   |      |      |      |     |+TIM1_CH2                                 |          |    |          |           
PA10, // |USB_FS_ID                   |    |    |    |     |     |     |*RX   |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PA11, // |USB_FS_DM                   |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |USB_FS_DP                   |    |    |    |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |TMS/SWDIO                   |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |TCK/SWCLK                   |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |TDI                         |    |    |    |     |     |     |      |      |      |      |     |+TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |ULPI_D1                     |    |    |    |     |     |     |      |      |      |      |*IN8 |*TIM8_CH2N *TIM3_CH3 *TIM1_CH2N           |          |    |          |           
PB1 , // |ULPI_D2                     |    |    |    |     |     |     |      |      |      |      |*IN9 |*TIM3_CH4 *TIM1_CH3N *TIM8_CH3N           |          |    |          |           
PB2 , // |SW1                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB3 , // |TDO/SWO                     |    |    |    |+SCK |     |+SCK |      |      |      |      |     |+TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |TRST                        |    |    |    |+MISO|     |+MISO|      |      |      |      |     |+TIM3_CH1                                 |          |    |          |*JTRST     
PB5 , // |ULPI_D7                     |    |    |    |+MOSI|     |+MOSI|      |      |      |      |     |+TIM3_CH2                                 |          |    |          |           
PB6 , // |I2C1_SCL [CAM_SCL]          |*SCL|    |    |     |     |     |+TX   |      |      |      |     |+TIM4_CH1                                 |          |    |          |           
PB7 , // |FSMC_NL [OneNAND_AVD]       |*SDA|    |    |     |     |     |+RX   |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PB8 , // |MII_TXD3                    |+SCL|    |    |     |     |     |      |      |      |      |     |+TIM10_CH1 +TIM4_CH3                      |          |*D4 |          |           
PB9 , // |I2C1_SDA [CAM_SDA]          |+SDA|    |    |     |     |     |      |      |      |      |     |+TIM4_CH4 +TIM11_CH1                      |          |*D5 |          |           
PB10, // |ULPI_D3                     |    |+SCL|    |     |*SCK |     |      |      |*TX   |      |     |+TIM2_CH3                                 |          |    |          |           
PB11, // |ULPI_D4                     |    |+SDA|    |     |     |     |      |      |*RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |ULPI_D5                     |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |ULPI_D6                     |    |    |    |     |+SCK |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PB14, // |MII_INT                     |    |    |    |     |+MISO|     |      |      |      |      |     |+TIM8_CH2N +TIM1_CH2N +TIM12_CH1          |*OTG_HS_DM|    |          |           
PB15, // |OneNAND_INT[OneNAND_INT]    |    |    |    |     |+MOSI|     |      |      |      |      |     |+TIM1_CH3N +TIM8_CH3N +TIM12_CH2          |*OTG_HS_DP|    |          |           
PC0 , // |ULPI_STP                    |    |    |    |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |MII_MDC                     |    |    |    |     |     |     |      |      |      |      |*IN11|                                          |          |    |          |           
PC2 , // |MII_TXD2                    |    |    |    |     |*MISO|     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |MII_TX_CLK                  |    |    |    |     |*MOSI|     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |MII_RXD0                    |    |    |    |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |MII_RXD1                    |    |    |    |     |     |     |      |      |      |      |*IN15|                                          |          |    |          |           
PC6 , // |I2S_MCK [CS43L22_MCLK]      |    |    |    |     |     |     |      |      |      |*TX   |     |+TIM3_CH1 *TIM8_CH1                       |          |*D6 |          |           
PC7 , // |LED4 [Blue]                 |    |    |    |     |     |     |      |      |      |*RX   |     |+TIM3_CH2 *TIM8_CH2                       |          |*D7 |          |           
PC8 , // |MicroSDCard_D0              |    |    |    |     |     |     |      |      |      |      |     |+TIM3_CH3 *TIM8_CH3                       |          |*D0 |          |           
PC9 , // |MicroSDCard_D1              |    |    |+SDA|     |     |     |      |      |      |      |     |+TIM3_CH4 *TIM8_CH4                       |          |*D1 |          |           
PC10, // |RS232_TX [ST3241_T2IN]      |    |    |    |     |     |*SCK |      |      |+TX   |      |     |                                          |          |*D2 |          |           
PC11, // |RS232_RX [ST3241_R3OUT]     |    |    |    |     |     |*MISO|      |      |+RX   |      |     |                                          |          |*D3 |          |           
PC12, // |MicroSDCard_CLK             |    |    |    |     |     |*MOSI|      |      |      |      |     |                                          |          |*CK |          |           
PC13, // |Anti_Tamper [Button B3]     |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |PC14-OSC32_IN               |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |PC15-OSC32_OUT              |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |D2                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD1 , // |D3                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |MicroSDCard_CMD             |    |    |    |     |     |     |      |      |      |      |     |                                          |          |*CMD|          |           
PD3 , // |FSMC_CLK [OneNAND_CLK]      |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD4 , // |FSMC_NOE                    |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |FSMC_NWE                    |    |    |    |     |     |     |      |+TX   |      |      |     |                                          |          |    |          |           
PD6 , // |FSMC_NWAIT [OneNAND_RDY]    |    |    |    |     |     |     |      |+RX   |      |      |     |                                          |          |    |          |           
PD7 , // |FSMC_NE1 [OneNAND_CE]       |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |D13                         |    |    |    |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |D14                         |    |    |    |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |D15                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |A16                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |A17                         |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PD13, // |A18                         |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PD14, // |D0                          |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH3                                 |          |    |          |           
PD15, // |D1                          |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH4                                 |          |    |          |           
PE0 , // |FSMC_NBL0 [SRAM_BLE]        |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |FSMC_NBL1 [SRAM_BHE]        |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |TRACE_CLK                   |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |A19                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |A20                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |TRACE_D2                    |    |    |    |     |     |     |      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |TRACE_D3                    |    |    |    |     |     |     |      |      |      |      |     |*TIM9_CH2                                 |          |    |          |*TRACED3   
PE7 , // |D4                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |D5                          |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |D6                          |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PE10, // |D7                          |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |D8                          |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PE12, // |D9                          |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |D10                         |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PE14, // |D11                         |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH4                                 |          |    |          |           
PE15, // |D12                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF0 , // |A0                          |    |*SDA|    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF1 , // |A1                          |    |*SCL|    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF2 , // |A2                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF3 , // |A3                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF4 , // |A4                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF5 , // |A5                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF6 , // |SmartCard_OFF               |    |    |    |     |     |     |      |      |      |      |     |*TIM10_CH1                                |          |    |          |           
PF7 , // |SmartCard_RST               |    |    |    |     |     |     |      |      |      |      |     |*TIM11_CH1                                |          |    |          |           
PF8 , // |                            |    |    |    |     |     |     |      |      |      |      |     |*TIM13_CH1                                |          |    |          |           
PF9 , // |Potentiometer [RV1]         |    |    |    |     |     |     |      |      |      |      |     |*TIM14_CH1                                |          |    |          |           
PF10, // |Audio_IN [TS472_OUT+]       |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF11, // |OTG_FS_OverCurrent          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF12, // |A6                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF13, // |A7                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF14, // |A8                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF15, // |A9                          |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG0 , // |A10                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG1 , // |A11                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG2 , // |A12                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG3 , // |A13                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG4 , // |A14                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG5 , // |A15                         |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG6 , // |LED1 [Green]                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG7 , // |SmartCard_CLK               |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG8 , // |LED2 [Orange]               |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG9 , // |FSMC_NE2 [SDRAM_CE]         |    |    |    |     |     |     |      |      |      |+RX   |     |                                          |          |    |          |           
PG10, // |FSMC_NE3 [TFT-LCD_CS]       |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG11, // |MII_TX_EN                   |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG12, // |SmartCard_CMDVCC            |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG13, // |MII_TXD0                    |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG14, // |MII_TXD1                    |    |    |    |     |     |     |      |      |      |+TX   |     |                                          |          |    |          |           
PG15, // |User_Button |Button B4]     |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH0 , // |PH0-OSC_IN                  |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC_IN   |           
PH1 , // |PH1-OSC_OUT                 |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC_OUT  |           
PH2 , // |MII_CRS                     |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH3 , // |MII_COL                     |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH4 , // |ULPI_NXT                    |    |+SCL|    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH5 , // |OTG_FS_PowerSwitchOn        |    |+SDA|    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH6 , // |MII_RXD2                    |    |    |    |     |     |     |      |      |      |      |     |*TIM12_CH1                                |          |    |          |           
PH7 , // |MII_RXD3                    |    |    |*SCL|     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH8 , // |DCMI_HSYNC                  |    |    |*SDA|     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH9 , // |DCMI_D0                     |    |    |    |     |     |     |      |      |      |      |     |*TIM12_CH2                                |          |    |          |           
PH10, // |DCMI_D1                     |    |    |    |     |     |     |      |      |      |      |     |+TIM5_CH1                                 |          |    |          |           
PH11, // |DCMI_D2                     |    |    |    |     |     |     |      |      |      |      |     |+TIM5_CH2                                 |          |    |          |           
PH12, // |DCMI_D3                     |    |    |    |     |     |     |      |      |      |      |     |+TIM5_CH3                                 |          |    |          |           
PH13, // |MicroSDCard_Detect          |    |    |    |     |     |     |      |      |      |      |     |+TIM8_CH1N                                |          |    |          |           
